<a href="https://colab.research.google.com/github/inhyek/machine_learning_toddler/blob/master/%5B%EA%B3%B5%EB%A3%A1%EC%B1%85%5D1_4_%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%95%B8%EB%93%A4%EB%A7%81_%EC%BD%94%EB%93%9C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
from google.colab import drive
drive.mount('/gdrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /gdrive

In [4]:
!ls /gdrive/My\ Drive/Colab\ Notebooks/data

diabetes.csv  funda_train.csv  titanic_test.csv  titanic_train.csv

In [5]:
### 데이터 불러와서 하는 기본 작업들

import pandas as pd
import numpy as np

# data loading
train = pd.read_csv('/gdrive/My Drive/Colab Notebooks/data/titanic_train.csv')

# shape 확인
print(train.shape)

# head 확인
print(train.head(3))

# null값 여부, dtype 확인
print(train.info())

# 기술통계 확인
print(train.describe())

(891, 12)
   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None
       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [6]:
# 특정 칼럼의 값들의 종류, 갯수 확인

print(train['Pclass'].value_counts())  #------> ()까먹지 말기. () 있을때랑 없을때랑 결과 다르게 나옴.

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [16]:
#1차원 array, list를 DataFrame으로 변환 

col_name1=['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)

#numpy ->  dataframe으로 변환

array_df = pd.DataFrame(array1, columns = col_name1)
print("array로 만든 Dataframe:\n", array_df)

#list dataframe으로 변환
list_df = pd.DataFrame(list1, columns = col_name1)
print("list로 만든 Dataframe:\n", list_df)

array로 만든 Dataframe:
    col1
0     1
1     2
2     3
list로 만든 Dataframe:
    col1
0     1
1     2
2     3

In [17]:
##3차원 array, list를 DataFrame으로 변환 

# 3개의 컬럼명이 필요함 
col_name2=['col1', 'col2', 'col3']

# 2행x3열 형태의 리스트와 ndarray 생성 한 뒤 이를 DataFrame으로 변환
list2 = [[1, 2, 3],
         [11, 12, 13]]

# array를 dataframe으로 변환
array2 = np.array(list2)
array2_df = pd.DataFrame(array2, columns = col_name2)

# list를 DataFrame으로 변환
list2_df =pd.DataFrame(list2, columns = col_name2)

print("리스트:\n", list2)
print("array:\n", array2)
print("3차원 array로 만든 데이터프레임:\n", array2_df)
print("3차원 list로 만든 데이터프레임:\n", list2_df)

리스트:
 [[1, 2, 3], [11, 12, 13]]
array:
 [[ 1  2  3]
 [11 12 13]]
3차원 array로 만든 데이터프레임:
    col1  col2  col3
0     1     2     3
1    11    12    13
3차원 list로 만든 데이터프레임:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [19]:
#Dictionary를 DataFrame으로 변환

#dictionary 형태의 자료 
dict = {'col1':[1, 11], 'col2':[2, 22], 'col3':[3, 33]}

#DataFrame으로 변환
dict_df = pd.DataFrame(dict) # -----> 컬럼 따로 안정해줘도 key =column명, value=컬럼별 datapoints가 되는 듯 

print(dict_df)

   col1  col2  col3
0     1     2     3
1    11    22    33

In [31]:
## DataFrame을 array, list, Dictionary로 변경하기

# DataFrame형태인 dict_df를,
print(type(dict_df))

# array로 변환  --- .values 메소드 사용 
df_to_array = dict_df.values
print(type(df_to_array))

# list로 변환 --- .values.tolist() -->()꼭 써야함!
df_to_list = dict_df.values.tolist()
print(type(df_to_list))

# dictionary로 변환 --- to_dict() --> values 없이 그냥 to_dict임!
df_to_dict = dict_df.to_dict()
print(type(df_to_dict))

<class 'pandas.core.frame.DataFrame'>
<class 'numpy.ndarray'>
<class 'list'>
<class 'dict'>

In [42]:
### DataFrame에 새 컬럼 추가하기

# 타이타닉 data 확인
train.head(3)

# 새롭게 추가할 칼럼명 적고 들어갈 데이터값 설정
train['Family_No'] = train['SibSp'] + train['Parch']+1
train['New Column'] = train['Age'] * 100
train.head(5)

   PassengerId  Survived  Pclass  ... Embarked Family_No  New Column
0            1         0       3  ...        S         2      2200.0
1            2         1       1  ...        C         2      3800.0
2            3         1       3  ...        S         1      2600.0
3            4         1       1  ...        S         2      3500.0
4            5         0       3  ...        S         1      3500.0

[5 rows x 14 columns]

In [45]:
### DataFrame에서 특정 행이나 열 삭제

# 새로 만든 컬럼들 삭제

drop_col_result = train.drop(['Family_No', 'New Column'], axis = 1, inplace=False)
drop_col_result.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

In [50]:
pd.set_option('display.width', 700)
pd.set_option('display.max_colwidth', 8)

train.head()

   PassengerId  Survived  Pclass     Name  ... Cabin  Embarked  Family_No  New Column
0        1            0        3  Brau...  ...   NaN        S         2     2200.0
1        2            1        1  Cumi...  ...   C85        C         2     3800.0
2        3            1        3  Heik...  ...   NaN        S         1     2600.0
3        4            1        1  Futr...  ...  C123        S         2     3500.0
4        5            0        3  Alle...  ...   NaN        S         1     3500.0

[5 rows x 14 columns]

In [53]:
drop_row_result = train.drop(0, axis = 0, inplace=False) # ---> 0번째 행을 지웠다.
drop_row_result.head(3)

   PassengerId  Survived  Pclass     Name  ... Cabin  Embarked  Family_No  New Column
1        2            1        1  Cumi...  ...   C85        C         2     3800.0
2        3            1        3  Heik...  ...   NaN        S         1     2600.0
3        4            1        1  Futr...  ...  C123        S         2     3500.0

[3 rows x 14 columns]

In [55]:
drop_0_result = train.drop(, inplace=False)
drop_0_result.head(3)

   PassengerId  Survived  Pclass     Name  ... Cabin  Embarked  Family_No  New Column
1        2            1        1  Cumi...  ...   C85        C         2     3800.0
2        3            1        3  Heik...  ...   NaN        S         1     2600.0
3        4            1        1  Futr...  ...  C123        S         2     3500.0

[3 rows x 14 columns]

In [0]:
### Index 객체 ---> 왜 공부하는거지? 어디에 쓰는거지?

In [63]:
### 데이터셀렉션 & 필터링 

#특정컬럼의 데이터 추출
print(train['Pclass'].head()) 
print(train[['Pclass', 'Name']].head()) # --> 두개이상 컬럼 들어가면 왜 리스트로 한 번 더 감싸지?

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64
   Pclass     Name
0       3  Brau...
1       1  Cumi...
2       3  Heik...
3       1  Futr...
4       3  Alle...

In [65]:
#특정행의 데이터 추출
train[0:3]

   PassengerId  Survived  Pclass     Name  ... Cabin  Embarked  Family_No  New Column
0        1            0        3  Brau...  ...   NaN        S         2     2200.0
1        2            1        1  Cumi...  ...   C85        C         2     3800.0
2        3            1        3  Heik...  ...   NaN        S         1     2600.0

[3 rows x 14 columns]

In [67]:
#특정 칼럼에 특정 값이 들어있는 데이터 추출
train[train['Pclass']==2].head() #---> 대괄호 활용법에 대해서 잘 모르겠다.

    PassengerId  Survived  Pclass  ... Embarked Family_No  New Column
9        10            1        2  ...        C        2    1400.0
15       16            1        2  ...        S        1    5500.0
17       18            1        2  ...        S        1       NaN
20       21            0        2  ...        S        1    3500.0
21       22            1        2  ...        S        1    3400.0

[5 rows x 14 columns]

In [77]:
#loc으로 특정행 특정열의 데이터값 확인하기

#위치기반은 .iloc 메서드를 사용한다. 좌표를 찍어준다. 
print(train.iloc[0,1])

#명칭기반은 .loc 메서드를 사용한다. 
print(train.loc[0,'Name']) #-->앞에 0은 index명

0
Braund, Mr. Owen Harris

In [78]:
#ix는 더이상 사용되지 않음
train.ix[0,0]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

1

In [82]:
### 불린 인덱싱 : 매우 편리한 데이터 필터링 방식. loc이나 iloc보다 많이 씀

#타이타닉 데이터에서 나이가 60세 이상인 승객 필터링하기
train.head()

train[train['Age']>=60].head()

     PassengerId  Survived  Pclass  ... Embarked Family_No  New Column
33        34            0        2  ...        S        1    6600.0
54        55            0        1  ...        C        2    6500.0
96        97            0        1  ...        C        1    7100.0
116      117            0        3  ...        Q        1    7050.0
170      171            0        1  ...        S        1    6100.0

[5 rows x 14 columns]

In [84]:
#나이가 60세 이상인 사람들의 이름과 나이 추출하기
train[train['Age']>=60][['Name','Age']].head(3)

       Name   Age
33  Whea...  66.0
54  Ostb...  65.0
96  Gold...  71.0

In [85]:
#나이가 60세 이상이고 선실등급이 1등급이며 성별이 여성인 승객 추출하기
train[(train['Age']>=60) & (train['Pclass']==1) &(train['Sex']=='female')].head()

     PassengerId  Survived  Pclass  ... Embarked Family_No  New Column
275      276            1        1  ...        S        2    6300.0
366      367            1        1  ...        C        2    6000.0
829      830            1        1  ...      NaN        1    6200.0

[3 rows x 14 columns]

In [88]:
#나이가 60세 이상, 선실등급 1등급, 성별 여성인 승객 추출하기 (2)
cond1 = train['Age']>=60
cond2 = train['Pclass']==1
cond3 = train['Sex']=='female'

train[cond1&cond2&cond3].head(3)

     PassengerId  Survived  Pclass  ... Embarked Family_No  New Column
275      276            1        1  ...        S        2    6300.0
366      367            1        1  ...        C        2    6000.0
829      830            1        1  ...      NaN        1    6200.0

[3 rows x 14 columns]

In [91]:
%timeit train[(train['Age']>=60) & (train['Pclass']==1) &(train['Sex']=='female')].head()

100 loops, best of 3: 2.36 ms per loop

In [93]:
%timeit train[cond1&cond2&cond3].head() ###--->왜 loop 도는 횟수가 다르지?

1000 loops, best of 3: 1.5 ms per loop

In [0]:
### 정렬, Aggegation, Groupby

# Name을 오름차순으로 정렬한다.

train.sort_values(by=['Name'], ascending=True, inplace=True)

In [96]:
train.head(3)

     PassengerId  Survived  Pclass  ... Embarked Family_No  New Column
845      846            0        3  ...        S        1    4200.0
746      747            0        3  ...        S        3    1600.0
279      280            1        3  ...        S        3    3500.0

[3 rows x 14 columns]

In [0]:
# Pclass와 Name을 내림차순으로 정렬한다.

train.sort_values(by=['Pclass', 'Name'], ascending=False, inplace=True)

In [98]:
train.head(3)

     PassengerId  Survived  Pclass  ... Embarked Family_No  New Column
868      869            0        3  ...        S        1       NaN
153      154            0        3  ...        S        3    4050.0
282      283            0        3  ...        S        1    1600.0

[3 rows x 14 columns]

In [99]:
#Aggregation 함수 (집계 함수란 여러행 또는 테이블 전체 행으로부터 하나의 결과값을 반환하는 함수이다.)

train.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
Family_No      891
New Column     714
dtype: int64

In [101]:
train[['Age','Fare']].mean()

Age     29.6...
Fare    32.2...
dtype: float64

In [0]:
# groupby() 적용

groupby_Pclass = train.groupby(by=['Pclass']).count()

In [109]:
groupby_Pclass

        PassengerId  Survived  Name  ...  Embarked  Family_No  New Column
Pclass                               ...
1           216          216    216  ...      214       216        186
2           184          184    184  ...      184       184        173
3           491          491    491  ...      491       491        355

[3 rows x 13 columns]

In [0]:
groupby_Pclass_mean = train.groupby('Pclass').mean()

In [111]:
groupby_Pclass_mean

        PassengerId  Survived      Age  ...     Fare  Family_No  New Column
Pclass                                  ...
1       461....      0.62...   38.2...  ...  84.1...  1.77...    3823...
2       445....      0.47...   29.8...  ...  20.6...  1.78...    2987...
3       439....      0.24...   25.1...  ...  13.6...  2.00...    2514...

[3 rows x 8 columns]

In [117]:
train.groupby('Pclass')['Age'].agg([min, max])

         min   max
Pclass
1       0.92  80.0
2       0.67  70.0
3       0.42  74.0

In [118]:
train.groupby('Pclass').agg({'Age':'min', 'SibSp':'sum', 'Fare':'mean'})

         Age  SibSp     Fare
Pclass
1       0.92     90  84.1...
2       0.67     74  20.6...
3       0.42    302  13.6...

In [120]:
### 결손 데이터 처리하기

#isna로 결손데이터 여부 확인

train.isna().head(3)

     PassengerId  Survived  Pclass  ...  Embarked  Family_No  New Column
868    False        False    False  ...    False     False       True
153    False        False    False  ...    False     False      False
282    False        False    False  ...    False     False      False

[3 rows x 14 columns]

In [121]:
#결손데이터 개수 확인

train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Family_No        0
New Column     177
dtype: int64

In [0]:
#'Cabin' 컬럼의 결손데이터 'C000'으로 대체하기

train['Cabin']= train['Cabin'].fillna('C000')

In [125]:
train.head()

     PassengerId  Survived  Pclass  ... Embarked Family_No  New Column
868      869            0        3  ...        S        1       NaN
153      154            0        3  ...        S        3    4050.0
282      283            0        3  ...        S        1    1600.0
286      287            1        3  ...        S        1    3000.0
559      560            1        3  ...        S        2    3600.0

[5 rows x 14 columns]

In [0]:
# 'Age'칼럼의 Nan값을 평균나이로, 'Embarked'칼럼의 Nan값을 'S'로 대체하기

train['Age'] = train['Age'].fillna(train['Age'].mean())
train['Embarked'] = train['Embarked'].fillna('S')

In [130]:
train.head(5)

     PassengerId  Survived  Pclass  ... Embarked Family_No  New Column
868      869            0        3  ...        S        1       NaN
153      154            0        3  ...        S        3    4050.0
282      283            0        3  ...        S        1    1600.0
286      287            1        3  ...        S        1    3000.0
559      560            1        3  ...        S        2    3600.0

[5 rows x 14 columns]

In [132]:
### apply lambda식으로 데이터 가공하기  --> 왜 쓰는거지? def로 함수만들어도 되는데. 만들기 편해서?? 


lambda_squares = lambda x : x * 2

lambda_squares(3)

6

In [139]:
# 여러개의 인자를 입력 받을 때는 map()함수를 사용함

a = [1,2,3]
squares = map(lambda x : x**2,a) 
print(list(squares))

[1, 4, 9]

In [141]:
# 나이가 15세 미만이면 Child, 그렇지 않으면 Adult로 구분하는 새로운 칼럼 만들기

train['Child_Adult'] = train['Age'].apply(lambda x : 'Child' if x < 15 else 'Adult') # ---> 문법 알아두기 
train[['Age','Child_Adult']].head(3)

         Age Child_Adult
868  29.6...    Adult
153  40.5...    Adult
282  16.0...    Adult

In [142]:
# elif 문법은 제공하지 않음. 하고싶으면 노가다해야함. 

train['Age_cat'] = train['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x <= 60 else 
                                                                                  'Elderly'))
train['Age_cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_cat, dtype: int64

In [144]:
# 나이에 따라 세분화된 분류를 수행하는 함수 생성 

def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else : cat = 'Elderly'
    
    return cat

# lambda 식에 위에서 생성한 get_category( ) 함수를 반환값으로 지정. 
# get_category(X)는 입력값으로 ‘Age’ 컬럼 값을 받아서 해당하는 cat 반환
train['Age_cat'] = train['Age'].apply(lambda x : get_category(x))
train[['Age','Age_cat']].head()

         Age  Age_cat
868  29.6...  Youn...
153  40.5...    Adult
282  16.0...  Teen...
286  30.0...  Youn...
559  36.0...    Adult